TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
/** \file hdr_syscon.h
 * \brief Header with definition of bits in system configuration registers
 * \author Freddie Chopin, http://www.freddiechopin.info/
 * \date 2012-01-08
 */

/******************************************************************************
* chip: LPC11xx
* compiler: arm-none-eabi-gcc (Sourcery CodeBench Lite 2011.09-69) 4.6.1
******************************************************************************/

#ifndef HDR_SYSCON_H_
#define HDR_SYSCON_H_

#pragma GCC system_header

/*
+-----------------------------------------------------------------------------+
| SYSMEMREMAP - System memory remap register
+-----------------------------------------------------------------------------+
*/

#define SYSMEMREMAP_MAP_bit					0
#define SYSMEMREMAP_MAP_0_bit				0
#define SYSMEMREMAP_MAP_1_bit				1

#define SYSMEMREMAP_MAP_0					(1 << SYSMEMREMAP_MAP_0_bit)
#define SYSMEMREMAP_MAP_1					(1 << SYSMEMREMAP_MAP_1_bit)

#define SYSMEMREMAP_MAP_BOOT_value			0
#define SYSMEMREMAP_MAP_RAM_value			1
#define SYSMEMREMAP_MAP_FLASH_value			2
#define SYSMEMREMAP_MAP_mask				3

#define SYSMEMREMAP_MAP_BOOT				(SYSMEMREMAP_MAP_BOOT_value << SYSMEMREMAP_MAP_bit)
#define SYSMEMREMAP_MAP_RAM					(SYSMEMREMAP_MAP_RAM_value << SYSMEMREMAP_MAP_bit)
#define SYSMEMREMAP_MAP_FLASH				(SYSMEMREMAP_MAP_FLASH_value << SYSMEMREMAP_MAP_bit)

/*
+-----------------------------------------------------------------------------+
| PRESETCTRL - Peripheral reset control register
+-----------------------------------------------------------------------------+
*/

#define PRESETCTRL_SSP0_RST_N_bit			0
#define PRESETCTRL_I2C_RST_N_bit			1
#define PRESETCTRL_SSP1_RST_N_bit			2
#define PRESETCTRL_CAN_RST_N_bit			3

#define PRESETCTRL_SSP0_RST_N				(1 << PRESETCTRL_SSP0_RST_N_bit)
#define PRESETCTRL_I2C_RST_N				(1 << PRESETCTRL_I2C_RST_N_bit)
#define PRESETCTRL_SSP1_RST_N				(1 << PRESETCTRL_SSP1_RST_N_bit)
#define PRESETCTRL_CAN_RST_N				(1 << PRESETCTRL_CAN_RST_N_bit)

/*
+-----------------------------------------------------------------------------+
| SYSPLLCTRL - System PLL control register
+-----------------------------------------------------------------------------+
*/

#define SYSPLLCTRL_MSEL_bit					0
#define SYSPLLCTRL_MSEL_0_bit				0
#define SYSPLLCTRL_MSEL_1_bit				1
#define SYSPLLCTRL_MSEL_2_bit				2
#define SYSPLLCTRL_MSEL_3_bit				3
#define SYSPLLCTRL_MSEL_4_bit				4
#define SYSPLLCTRL_PSEL_bit					5
#define SYSPLLCTRL_PSEL_0_bit				5
#define SYSPLLCTRL_PSEL_1_bit				6

#define SYSPLLCTRL_MSEL_0					(1 << SYSPLLCTRL_MSEL_0_bit)
#define SYSPLLCTRL_MSEL_1					(1 << SYSPLLCTRL_MSEL_1_bit)
#define SYSPLLCTRL_MSEL_2					(1 << SYSPLLCTRL_MSEL_2_bit)
#define SYSPLLCTRL_MSEL_3					(1 << SYSPLLCTRL_MSEL_3_bit)
#define SYSPLLCTRL_MSEL_4					(1 << SYSPLLCTRL_MSEL_4_bit)
#define SYSPLLCTRL_PSEL_0					(1 << SYSPLLCTRL_PSEL_0_bit)
#define SYSPLLCTRL_PSEL_1					(1 << SYSPLLCTRL_PSEL_1_bit)

#define SYSPLLCTRL_MSEL_1_value				0
#define SYSPLLCTRL_MSEL_2_value				1
#define SYSPLLCTRL_MSEL_3_value				2
#define SYSPLLCTRL_MSEL_4_value				3
#define SYSPLLCTRL_MSEL_5_value				4
#define SYSPLLCTRL_MSEL_6_value				5
#define SYSPLLCTRL_MSEL_7_value				6
#define SYSPLLCTRL_MSEL_8_value				7
#define SYSPLLCTRL_MSEL_9_value				8
#define SYSPLLCTRL_MSEL_10_value			9
#define SYSPLLCTRL_MSEL_11_value			10
#define SYSPLLCTRL_MSEL_12_value			11
#define SYSPLLCTRL_MSEL_13_value			12
#define SYSPLLCTRL_MSEL_14_value			13
#define SYSPLLCTRL_MSEL_15_value			14
#define SYSPLLCTRL_MSEL_16_value			15
#define SYSPLLCTRL_MSEL_17_value			16
#define SYSPLLCTRL_MSEL_18_value			17
#define SYSPLLCTRL_MSEL_19_value			18
#define SYSPLLCTRL_MSEL_20_value			19
#define SYSPLLCTRL_MSEL_21_value			20
#define SYSPLLCTRL_MSEL_22_value			21
#define SYSPLLCTRL_MSEL_23_value			22
#define SYSPLLCTRL_MSEL_24_value			23
#define SYSPLLCTRL_MSEL_25_value			24
#define SYSPLLCTRL_MSEL_26_value			25
#define SYSPLLCTRL_MSEL_27_value			26
#define SYSPLLCTRL_MSEL_28_value			27
#define SYSPLLCTRL_MSEL_29_value			28
#define SYSPLLCTRL_MSEL_30_value			29
#define SYSPLLCTRL_MSEL_31_value			30
#define SYSPLLCTRL_MSEL_32_value			31
#define SYSPLLCTRL_MSEL_mask				31

#define SYSPLLCTRL_PSEL_1_value				0
#define SYSPLLCTRL_PSEL_2_value				1
#define SYSPLLCTRL_PSEL_4_value				2
#define SYSPLLCTRL_PSEL_8_value				3
#define SYSPLLCTRL_PSEL_mask				3

// underscores removed to avoid redefinition

#define SYSPLLCTRL_MSEL1					(SYSPLLCTRL_MSEL_1_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL2					(SYSPLLCTRL_MSEL_2_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL3					(SYSPLLCTRL_MSEL_3_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL4					(SYSPLLCTRL_MSEL_4_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL5					(SYSPLLCTRL_MSEL_5_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL6					(SYSPLLCTRL_MSEL_6_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL7					(SYSPLLCTRL_MSEL_7_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL8					(SYSPLLCTRL_MSEL_8_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL9					(SYSPLLCTRL_MSEL_9_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL10					(SYSPLLCTRL_MSEL_10_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL11					(SYSPLLCTRL_MSEL_11_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL12					(SYSPLLCTRL_MSEL_12_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL13					(SYSPLLCTRL_MSEL_13_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL14					(SYSPLLCTRL_MSEL_14_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL15					(SYSPLLCTRL_MSEL_15_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL16					(SYSPLLCTRL_MSEL_16_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL17					(SYSPLLCTRL_MSEL_17_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL18					(SYSPLLCTRL_MSEL_18_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL19					(SYSPLLCTRL_MSEL_19_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL20					(SYSPLLCTRL_MSEL_20_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL21					(SYSPLLCTRL_MSEL_21_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL22					(SYSPLLCTRL_MSEL_22_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL23					(SYSPLLCTRL_MSEL_23_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL24					(SYSPLLCTRL_MSEL_24_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL25					(SYSPLLCTRL_MSEL_25_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL26					(SYSPLLCTRL_MSEL_26_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL27					(SYSPLLCTRL_MSEL_27_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL28					(SYSPLLCTRL_MSEL_28_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL29					(SYSPLLCTRL_MSEL_29_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL30					(SYSPLLCTRL_MSEL_30_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL31					(SYSPLLCTRL_MSEL_31_value << SYSPLLCTRL_MSEL_bit)
#define SYSPLLCTRL_MSEL32					(SYSPLLCTRL_MSEL_32_value << SYSPLLCTRL_MSEL_bit)

