TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
// underscores removed to avoid redefinition

#define SYSPLLCTRL_PSEL1					(SYSPLLCTRL_PSEL_1_value << SYSPLLCTRL_PSEL_bit)
#define SYSPLLCTRL_PSEL2					(SYSPLLCTRL_PSEL_2_value << SYSPLLCTRL_PSEL_bit)
#define SYSPLLCTRL_PSEL4					(SYSPLLCTRL_PSEL_4_value << SYSPLLCTRL_PSEL_bit)
#define SYSPLLCTRL_PSEL8					(SYSPLLCTRL_PSEL_8_value << SYSPLLCTRL_PSEL_bit)

/*
+-----------------------------------------------------------------------------+
| SYSPLLSTAT - System PLL status register
+-----------------------------------------------------------------------------+
*/

#define SYSPLLSTAT_LOCK_bit					0

#define SYSPLLSTAT_LOCK						(1 << SYSPLLSTAT_LOCK_bit)

/*
+-----------------------------------------------------------------------------+
| SYSOSCCTRL - System oscillator control register
+-----------------------------------------------------------------------------+
*/

#define SYSOSCCTRL_BYPASS_bit				0
#define SYSOSCCTRL_FREQRANGE_bit			1

#define SYSOSCCTRL_BYPASS					(1 << SYSOSCCTRL_BYPASS_bit)
#define SYSOSCCTRL_FREQRANGE				(1 << SYSOSCCTRL_FREQRANGE_bit)

/*
+-----------------------------------------------------------------------------+
| WDTOSCCTRL - Watchdog oscillator control register
+-----------------------------------------------------------------------------+
*/

#define WDTOSCCTRL_DIVSEL_bit				0
#define WDTOSCCTRL_DIVSEL_0_bit				0
#define WDTOSCCTRL_DIVSEL_1_bit				1
#define WDTOSCCTRL_DIVSEL_2_bit				2
#define WDTOSCCTRL_DIVSEL_3_bit				3
#define WDTOSCCTRL_DIVSEL_4_bit				4
#define WDTOSCCTRL_FREQSEL_bit				5
#define WDTOSCCTRL_FREQSEL_0_bit			5
#define WDTOSCCTRL_FREQSEL_1_bit			6
#define WDTOSCCTRL_FREQSEL_2_bit			7
#define WDTOSCCTRL_FREQSEL_3_bit			8

#define WDTOSCCTRL_DIVSEL_0					(1 << WDTOSCCTRL_DIVSEL_0_bit)
#define WDTOSCCTRL_DIVSEL_1					(1 << WDTOSCCTRL_DIVSEL_1_bit)
#define WDTOSCCTRL_DIVSEL_2					(1 << WDTOSCCTRL_DIVSEL_2_bit)
#define WDTOSCCTRL_DIVSEL_3					(1 << WDTOSCCTRL_DIVSEL_3_bit)
#define WDTOSCCTRL_DIVSEL_4					(1 << WDTOSCCTRL_DIVSEL_4_bit)
#define WDTOSCCTRL_FREQSEL_0				(1 << WDTOSCCTRL_FREQSEL_0_bit)
#define WDTOSCCTRL_FREQSEL_1				(1 << WDTOSCCTRL_FREQSEL_1_bit)
#define WDTOSCCTRL_FREQSEL_2				(1 << WDTOSCCTRL_FREQSEL_2_bit)
#define WDTOSCCTRL_FREQSEL_3				(1 << WDTOSCCTRL_FREQSEL_3_bit)

#define WDTOSCCTRL_DIVSEL_2_value			0
#define WDTOSCCTRL_DIVSEL_4_value			1
#define WDTOSCCTRL_DIVSEL_6_value			2
#define WDTOSCCTRL_DIVSEL_8_value			3
#define WDTOSCCTRL_DIVSEL_10_value			4
#define WDTOSCCTRL_DIVSEL_12_value			5
#define WDTOSCCTRL_DIVSEL_14_value			6
#define WDTOSCCTRL_DIVSEL_16_value			7
#define WDTOSCCTRL_DIVSEL_18_value			8
#define WDTOSCCTRL_DIVSEL_20_value			9
#define WDTOSCCTRL_DIVSEL_22_value			10
#define WDTOSCCTRL_DIVSEL_24_value			11
#define WDTOSCCTRL_DIVSEL_26_value			12
#define WDTOSCCTRL_DIVSEL_28_value			13
#define WDTOSCCTRL_DIVSEL_30_value			14
#define WDTOSCCTRL_DIVSEL_32_value			15
#define WDTOSCCTRL_DIVSEL_34_value			16
#define WDTOSCCTRL_DIVSEL_36_value			17
#define WDTOSCCTRL_DIVSEL_38_value			18
#define WDTOSCCTRL_DIVSEL_40_value			19
#define WDTOSCCTRL_DIVSEL_42_value			20
#define WDTOSCCTRL_DIVSEL_44_value			21
#define WDTOSCCTRL_DIVSEL_46_value			22
#define WDTOSCCTRL_DIVSEL_48_value			23
#define WDTOSCCTRL_DIVSEL_50_value			24
#define WDTOSCCTRL_DIVSEL_52_value			25
#define WDTOSCCTRL_DIVSEL_54_value			26
#define WDTOSCCTRL_DIVSEL_56_value			27
#define WDTOSCCTRL_DIVSEL_58_value			28
#define WDTOSCCTRL_DIVSEL_60_value			29
#define WDTOSCCTRL_DIVSEL_62_value			30
#define WDTOSCCTRL_DIVSEL_64_value			31
#define WDTOSCCTRL_DIVSEL_mask				31

#define WDTOSCCTRL_FREQSEL_500kHz_value		1
#define WDTOSCCTRL_FREQSEL_800kHz_value		2
#define WDTOSCCTRL_FREQSEL_1100kHz_value	3
#define WDTOSCCTRL_FREQSEL_1400kHz_value	4
#define WDTOSCCTRL_FREQSEL_1600kHz_value	5
#define WDTOSCCTRL_FREQSEL_1800kHz_value	6
#define WDTOSCCTRL_FREQSEL_2000kHz_value	7
#define WDTOSCCTRL_FREQSEL_2200kHz_value	8
#define WDTOSCCTRL_FREQSEL_2400kHz_value	9
#define WDTOSCCTRL_FREQSEL_2600kHz_value	10
#define WDTOSCCTRL_FREQSEL_2700kHz_value	11
#define WDTOSCCTRL_FREQSEL_2900kHz_value	12
#define WDTOSCCTRL_FREQSEL_3100kHz_value	13
#define WDTOSCCTRL_FREQSEL_3200kHz_value	14
#define WDTOSCCTRL_FREQSEL_3400kHz_value	15
#define WDTOSCCTRL_FREQSEL_mask				15

// underscores removed to avoid redefinition

#define WDTOSCCTRL_DIVSEL2					(WDTOSCCTRL_DIVSEL_2_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL4					(WDTOSCCTRL_DIVSEL_4_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL6					(WDTOSCCTRL_DIVSEL_6_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL8					(WDTOSCCTRL_DIVSEL_8_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL10					(WDTOSCCTRL_DIVSEL_10_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL12					(WDTOSCCTRL_DIVSEL_12_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL14					(WDTOSCCTRL_DIVSEL_14_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL16					(WDTOSCCTRL_DIVSEL_16_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL18					(WDTOSCCTRL_DIVSEL_18_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL20					(WDTOSCCTRL_DIVSEL_20_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL22					(WDTOSCCTRL_DIVSEL_22_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL24					(WDTOSCCTRL_DIVSEL_24_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL26					(WDTOSCCTRL_DIVSEL_26_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL28					(WDTOSCCTRL_DIVSEL_28_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL30					(WDTOSCCTRL_DIVSEL_30_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL32					(WDTOSCCTRL_DIVSEL_32_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL34					(WDTOSCCTRL_DIVSEL_34_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL36					(WDTOSCCTRL_DIVSEL_36_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL38					(WDTOSCCTRL_DIVSEL_38_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL40					(WDTOSCCTRL_DIVSEL_40_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL42					(WDTOSCCTRL_DIVSEL_42_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL44					(WDTOSCCTRL_DIVSEL_44_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL46					(WDTOSCCTRL_DIVSEL_46_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL48					(WDTOSCCTRL_DIVSEL_48_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL50					(WDTOSCCTRL_DIVSEL_50_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL52					(WDTOSCCTRL_DIVSEL_52_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL54					(WDTOSCCTRL_DIVSEL_54_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL56					(WDTOSCCTRL_DIVSEL_56_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL58					(WDTOSCCTRL_DIVSEL_58_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL60					(WDTOSCCTRL_DIVSEL_60_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL62					(WDTOSCCTRL_DIVSEL_62_value << WDTOSCCTRL_DIVSEL_bit)
#define WDTOSCCTRL_DIVSEL64					(WDTOSCCTRL_DIVSEL_64_value << WDTOSCCTRL_DIVSEL_bit)

