TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
#define WDTOSCCTRL_FREQSEL_500kHz			(WDTOSCCTRL_FREQSEL_500kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_800kHz			(WDTOSCCTRL_FREQSEL_800kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_1100kHz			(WDTOSCCTRL_FREQSEL_1100kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_1400kHz			(WDTOSCCTRL_FREQSEL_1400kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_1600kHz			(WDTOSCCTRL_FREQSEL_1600kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_1800kHz			(WDTOSCCTRL_FREQSEL_1800kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_2000kHz			(WDTOSCCTRL_FREQSEL_2000kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_2200kHz			(WDTOSCCTRL_FREQSEL_2200kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_2400kHz			(WDTOSCCTRL_FREQSEL_2400kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_2600kHz			(WDTOSCCTRL_FREQSEL_2600kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_2700kHz			(WDTOSCCTRL_FREQSEL_2700kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_2900kHz			(WDTOSCCTRL_FREQSEL_2900kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_3100kHz			(WDTOSCCTRL_FREQSEL_3100kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_3200kHz			(WDTOSCCTRL_FREQSEL_3200kHz_value << WDTOSCCTRL_FREQSEL_bit)
#define WDTOSCCTRL_FREQSEL_3400kHz			(WDTOSCCTRL_FREQSEL_3400kHz_value << WDTOSCCTRL_FREQSEL_bit)

/*
+-----------------------------------------------------------------------------+
| IRCCTRL - Internal resonant crystal control register
+-----------------------------------------------------------------------------+
*/

#define IRCCTRL_TRIM_bit					0
#define IRCCTRL_TRIM_0_bit					0
#define IRCCTRL_TRIM_1_bit					1
#define IRCCTRL_TRIM_2_bit					2
#define IRCCTRL_TRIM_3_bit					3
#define IRCCTRL_TRIM_4_bit					4
#define IRCCTRL_TRIM_5_bit					5
#define IRCCTRL_TRIM_6_bit					6
#define IRCCTRL_TRIM_7_bit					7

#define IRCCTRL_TRIM_0						(1 << IRCCTRL_TRIM_0_bit)
#define IRCCTRL_TRIM_1						(1 << IRCCTRL_TRIM_1_bit)
#define IRCCTRL_TRIM_2						(1 << IRCCTRL_TRIM_2_bit)
#define IRCCTRL_TRIM_3						(1 << IRCCTRL_TRIM_3_bit)
#define IRCCTRL_TRIM_4						(1 << IRCCTRL_TRIM_4_bit)
#define IRCCTRL_TRIM_5						(1 << IRCCTRL_TRIM_5_bit)
#define IRCCTRL_TRIM_6						(1 << IRCCTRL_TRIM_6_bit)
#define IRCCTRL_TRIM_7						(1 << IRCCTRL_TRIM_7_bit)

/*
+-----------------------------------------------------------------------------+
| SYSRSTSTAT - System reset status register
+-----------------------------------------------------------------------------+
*/

#define SYSRSTSTAT_POR_bit					0
#define SYSRSTSTAT_EXTRST_bit				1
#define SYSRSTSTAT_WDT_bit					2
#define SYSRSTSTAT_BOD_bit					3
#define SYSRSTSTAT_SYSRST_bit				4

#define SYSRSTSTAT_POR						(1 << SYSRSTSTAT_POR_bit)
#define SYSRSTSTAT_EXTRST					(1 << SYSRSTSTAT_EXTRST_bit)
#define SYSRSTSTAT_WDT						(1 << SYSRSTSTAT_WDT_bit)
#define SYSRSTSTAT_BOD						(1 << SYSRSTSTAT_BOD_bit)
#define SYSRSTSTAT_SYSRST					(1 << SYSRSTSTAT_SYSRST_bit)

/*
+-----------------------------------------------------------------------------+
| SYSPLLCLKSEL - System PLL clock source select register
+-----------------------------------------------------------------------------+
*/

#define SYSPLLCLKSEL_SEL_bit				0
#define SYSPLLCLKSEL_SEL_0_bit				0
#define SYSPLLCLKSEL_SEL_1_bit				1

#define SYSPLLCLKSEL_SEL_0					(1 << SYSPLLCLKSEL_SEL_0_bit)
#define SYSPLLCLKSEL_SEL_1					(1 << SYSPLLCLKSEL_SEL_1_bit)

#define SYSPLLCLKSEL_SEL_IRC_value			0
#define SYSPLLCLKSEL_SEL_SYSOSC_value		1
#define SYSPLLCLKSEL_SEL_mask				3

#define SYSPLLCLKSEL_SEL_IRC				(SYSPLLCLKSEL_SEL_IRC_value	<< SYSPLLCLKSEL_SEL_bit)
#define SYSPLLCLKSEL_SEL_SYSOSC				(SYSPLLCLKSEL_SEL_SYSOSC_value	<< SYSPLLCLKSEL_SEL_bit)

/*
+-----------------------------------------------------------------------------+
| SYSPLLUEN - System PLL clock source update enable register
+-----------------------------------------------------------------------------+
*/

#define SYSPLLUEN_ENA_bit					0

#define SYSPLLUEN_ENA						(1 << SYSPLLUEN_ENA_bit)

/*
+-----------------------------------------------------------------------------+
| MAINCLKSEL - Main clock source select register
+-----------------------------------------------------------------------------+
*/

#define MAINCLKSEL_SEL_bit					0
#define MAINCLKSEL_SEL_0_bit				0
#define MAINCLKSEL_SEL_1_bit				1

#define MAINCLKSEL_SEL_0					(1 << MAINCLKSEL_SEL_0_bit)
#define MAINCLKSEL_SEL_1					(1 << MAINCLKSEL_SEL_1_bit)

#define MAINCLKSEL_SEL_IRC_value			0
#define MAINCLKSEL_SEL_PLLIN_value			1
#define MAINCLKSEL_SEL_WDT_value			2
#define MAINCLKSEL_SEL_PLLOUT_value			3
#define MAINCLKSEL_SEL_mask					3

#define MAINCLKSEL_SEL_IRC					(MAINCLKSEL_SEL_IRC_value << MAINCLKSEL_SEL_bit)
#define MAINCLKSEL_SEL_PLLIN				(MAINCLKSEL_SEL_PLLIN_value << MAINCLKSEL_SEL_bit)
#define MAINCLKSEL_SEL_WDT					(MAINCLKSEL_SEL_WDT_value << MAINCLKSEL_SEL_bit)
#define MAINCLKSEL_SEL_PLLOUT				(MAINCLKSEL_SEL_PLLOUT_value << MAINCLKSEL_SEL_bit)

/*
+-----------------------------------------------------------------------------+
| MAINCLKUEN - Main clock source update enable register
+-----------------------------------------------------------------------------+
*/

#define MAINCLKUEN_ENA_bit					0

#define MAINCLKUEN_ENA						(1 << MAINCLKUEN_ENA_bit)

/*
+-----------------------------------------------------------------------------+
| SYSAHBCLKDIV - System AHB clock divider register
+-----------------------------------------------------------------------------+
*/

#define SYSAHBCLKDIV_DIV_bit				0
#define SYSAHBCLKDIV_DIV_0_bit				0
#define SYSAHBCLKDIV_DIV_1_bit				1
#define SYSAHBCLKDIV_DIV_2_bit				2
#define SYSAHBCLKDIV_DIV_3_bit				3
#define SYSAHBCLKDIV_DIV_4_bit				4
#define SYSAHBCLKDIV_DIV_5_bit				5
#define SYSAHBCLKDIV_DIV_6_bit				6
#define SYSAHBCLKDIV_DIV_7_bit				7

#define SYSAHBCLKDIV_DIV_0					(1 << SYSAHBCLKDIV_DIV_0_bit)
#define SYSAHBCLKDIV_DIV_1					(1 << SYSAHBCLKDIV_DIV_1_bit)
#define SYSAHBCLKDIV_DIV_2					(1 << SYSAHBCLKDIV_DIV_2_bit)
#define SYSAHBCLKDIV_DIV_3					(1 << SYSAHBCLKDIV_DIV_3_bit)
#define SYSAHBCLKDIV_DIV_4					(1 << SYSAHBCLKDIV_DIV_4_bit)
#define SYSAHBCLKDIV_DIV_5					(1 << SYSAHBCLKDIV_DIV_5_bit)
#define SYSAHBCLKDIV_DIV_6					(1 << SYSAHBCLKDIV_DIV_6_bit)
#define SYSAHBCLKDIV_DIV_7					(1 << SYSAHBCLKDIV_DIV_7_bit)

#define SYSAHBCLKDIV_DIV_CLKDISABLED_value	0
#define SYSAHBCLKDIV_DIV_mask				255

#define SYSAHBCLKDIV_DIV_CLKDISABLED		(SYSAHBCLKDIV_DIV_CLKDISABLED_value << SYSAHBCLKDIV_DIV_bit)

