TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
/*
+-----------------------------------------------------------------------------+
| SYSAHBCLKCTRL - System AHB clock control register
+-----------------------------------------------------------------------------+
*/

#define SYSAHBCLKCTRL_SYS_bit				0
#define SYSAHBCLKCTRL_ROM_bit				1
#define SYSAHBCLKCTRL_RAM_bit				2
#define SYSAHBCLKCTRL_FLASHREG_bit			3
#define SYSAHBCLKCTRL_FLASHARRAY_bit		4
#define SYSAHBCLKCTRL_I2C_bit				5
#define SYSAHBCLKCTRL_GPIO_bit				6
#define SYSAHBCLKCTRL_CT16B0_bit			7
#define SYSAHBCLKCTRL_CT16B1_bit			8
#define SYSAHBCLKCTRL_CT32B0_bit			9
#define SYSAHBCLKCTRL_CT32B1_bit			10
#define SYSAHBCLKCTRL_SSP0_bit				11
#define SYSAHBCLKCTRL_UART_bit				12
#define SYSAHBCLKCTRL_ADC_bit				13
#define SYSAHBCLKCTRL_WDT_bit				15
#define SYSAHBCLKCTRL_IOCON_bit				16
#define SYSAHBCLKCTRL_CAN_bit				17
#define SYSAHBCLKCTRL_SSP1_bit				18

#define SYSAHBCLKCTRL_SYS					(1 << SYSAHBCLKCTRL_SYS_bit)
#define SYSAHBCLKCTRL_ROM					(1 << SYSAHBCLKCTRL_ROM_bit)
#define SYSAHBCLKCTRL_RAM					(1 << SYSAHBCLKCTRL_RAM_bit)
#define SYSAHBCLKCTRL_FLASHREG				(1 << SYSAHBCLKCTRL_FLASHREG_bit)
#define SYSAHBCLKCTRL_FLASHARRAY			(1 << SYSAHBCLKCTRL_FLASHARRAY_bit)
#define SYSAHBCLKCTRL_I2C					(1 << SYSAHBCLKCTRL_I2C_bit)
#define SYSAHBCLKCTRL_GPIO					(1 << SYSAHBCLKCTRL_GPIO_bit)
#define SYSAHBCLKCTRL_CT16B0				(1 << SYSAHBCLKCTRL_CT16B0_bit)
#define SYSAHBCLKCTRL_CT16B1				(1 << SYSAHBCLKCTRL_CT16B1_bit)
#define SYSAHBCLKCTRL_CT32B0				(1 << SYSAHBCLKCTRL_CT32B0_bit)
#define SYSAHBCLKCTRL_CT32B1				(1 << SYSAHBCLKCTRL_CT32B1_bit)
#define SYSAHBCLKCTRL_SSP0					(1 << SYSAHBCLKCTRL_SSP0_bit)
#define SYSAHBCLKCTRL_UART					(1 << SYSAHBCLKCTRL_UART_bit)
#define SYSAHBCLKCTRL_ADC					(1 << SYSAHBCLKCTRL_ADC_bit)
#define SYSAHBCLKCTRL_WDT					(1 << SYSAHBCLKCTRL_WDT_bit)
#define SYSAHBCLKCTRL_IOCON					(1 << SYSAHBCLKCTRL_IOCON_bit)
#define SYSAHBCLKCTRL_CAN					(1 << SYSAHBCLKCTRL_CAN_bit)
#define SYSAHBCLKCTRL_SSP1					(1 << SYSAHBCLKCTRL_SSP1_bit)

/*
+-----------------------------------------------------------------------------+
| SSP0CLKDIV - SPI0 clock divider register
+-----------------------------------------------------------------------------+
*/

#define SSP0CLKDIV_DIV_bit					0
#define SSP0CLKDIV_DIV_0_bit				0
#define SSP0CLKDIV_DIV_1_bit				1
#define SSP0CLKDIV_DIV_2_bit				2
#define SSP0CLKDIV_DIV_3_bit				3
#define SSP0CLKDIV_DIV_4_bit				4
#define SSP0CLKDIV_DIV_5_bit				5
#define SSP0CLKDIV_DIV_6_bit				6
#define SSP0CLKDIV_DIV_7_bit				7

#define SSP0CLKDIV_DIV_0					(1 << SSP0CLKDIV_DIV_0_bit)
#define SSP0CLKDIV_DIV_1					(1 << SSP0CLKDIV_DIV_1_bit)
#define SSP0CLKDIV_DIV_2					(1 << SSP0CLKDIV_DIV_2_bit)
#define SSP0CLKDIV_DIV_3					(1 << SSP0CLKDIV_DIV_3_bit)
#define SSP0CLKDIV_DIV_4					(1 << SSP0CLKDIV_DIV_4_bit)
#define SSP0CLKDIV_DIV_5					(1 << SSP0CLKDIV_DIV_5_bit)
#define SSP0CLKDIV_DIV_6					(1 << SSP0CLKDIV_DIV_6_bit)
#define SSP0CLKDIV_DIV_7					(1 << SSP0CLKDIV_DIV_7_bit)

#define SSP0CLKDIV_DIV_CLKDISABLED_value	0
#define SSP0CLKDIV_DIV_mask					255

#define SSP0CLKDIV_DIV_CLKDISABLED			(SSP0CLKDIV_DIV_CLKDISABLED_value << SSP0CLKDIV_DIV_bit)

/*
+-----------------------------------------------------------------------------+
| UARTCLKDIV - UART clock divider register
+-----------------------------------------------------------------------------+
*/

#define UARTCLKDIV_DIV_bit					0
#define UARTCLKDIV_DIV_0_bit				0
#define UARTCLKDIV_DIV_1_bit				1
#define UARTCLKDIV_DIV_2_bit				2
#define UARTCLKDIV_DIV_3_bit				3
#define UARTCLKDIV_DIV_4_bit				4
#define UARTCLKDIV_DIV_5_bit				5
#define UARTCLKDIV_DIV_6_bit				6
#define UARTCLKDIV_DIV_7_bit				7

#define UARTCLKDIV_DIV_0					(1 << UARTCLKDIV_DIV_0_bit)
#define UARTCLKDIV_DIV_1					(1 << UARTCLKDIV_DIV_1_bit)
#define UARTCLKDIV_DIV_2					(1 << UARTCLKDIV_DIV_2_bit)
#define UARTCLKDIV_DIV_3					(1 << UARTCLKDIV_DIV_3_bit)
#define UARTCLKDIV_DIV_4					(1 << UARTCLKDIV_DIV_4_bit)
#define UARTCLKDIV_DIV_5					(1 << UARTCLKDIV_DIV_5_bit)
#define UARTCLKDIV_DIV_6					(1 << UARTCLKDIV_DIV_6_bit)
#define UARTCLKDIV_DIV_7					(1 << UARTCLKDIV_DIV_7_bit)

#define UARTCLKDIV_DIV_CLKDISABLED_value	0
#define UARTCLKDIV_DIV_mask					255

#define UARTCLKDIV_DIV_CLKDISABLED			(UARTCLKDIV_DIV_CLKDISABLED_value << UARTCLKDIV_DIV_bit)

/*
+-----------------------------------------------------------------------------+
| SSP1CLKDIV - SPI1 clock divider register
+-----------------------------------------------------------------------------+
*/

#define SSP1CLKDIV_DIV_bit					0
#define SSP1CLKDIV_DIV_0_bit				0
#define SSP1CLKDIV_DIV_1_bit				1
#define SSP1CLKDIV_DIV_2_bit				2
#define SSP1CLKDIV_DIV_3_bit				3
#define SSP1CLKDIV_DIV_4_bit				4
#define SSP1CLKDIV_DIV_5_bit				5
#define SSP1CLKDIV_DIV_6_bit				6
#define SSP1CLKDIV_DIV_7_bit				7

#define SSP1CLKDIV_DIV_0					(1 << SSP1CLKDIV_DIV_0_bit)
#define SSP1CLKDIV_DIV_1					(1 << SSP1CLKDIV_DIV_1_bit)
#define SSP1CLKDIV_DIV_2					(1 << SSP1CLKDIV_DIV_2_bit)
#define SSP1CLKDIV_DIV_3					(1 << SSP1CLKDIV_DIV_3_bit)
#define SSP1CLKDIV_DIV_4					(1 << SSP1CLKDIV_DIV_4_bit)
#define SSP1CLKDIV_DIV_5					(1 << SSP1CLKDIV_DIV_5_bit)
#define SSP1CLKDIV_DIV_6					(1 << SSP1CLKDIV_DIV_6_bit)
#define SSP1CLKDIV_DIV_7					(1 << SSP1CLKDIV_DIV_7_bit)

#define SSP1CLKDIV_DIV_CLKDISABLED_value	0
#define SSP1CLKDIV_DIV_mask					255

#define SSP1CLKDIV_DIV_CLKDISABLED			(SSP1CLKDIV_DIV_CLKDISABLED_value << SSP1CLKDIV_DIV_bit)

/*
+-----------------------------------------------------------------------------+
| WDTCLKSEL - WDT clock source select register
+-----------------------------------------------------------------------------+
*/

#define WDTCLKSEL_SEL_bit					0
#define WDTCLKSEL_SEL_0_bit					0
#define WDTCLKSEL_SEL_1_bit					1

#define WDTCLKSEL_SEL_0						(1 << WDTCLKSEL_SEL_0_bit)
#define WDTCLKSEL_SEL_1						(1 << WDTCLKSEL_SEL_1_bit)

#define WDTCLKSEL_SEL_IRC_value				0
#define WDTCLKSEL_SEL_MAINCLK_value			1
#define WDTCLKSEL_SEL_WDTOSC_value			2
#define WDTCLKSEL_SEL_mask					255

#define WDTCLKSEL_SEL_IRC					(WDTCLKSEL_SEL_IRC_value << WDTCLKSEL_SEL_bit)
#define WDTCLKSEL_SEL_MAINCLK				(WDTCLKSEL_SEL_MAINCLK_value << WDTCLKSEL_SEL_bit)
#define WDTCLKSEL_SEL_WDTOSC				(WDTCLKSEL_SEL_WDTOSC_value << WDTCLKSEL_SEL_bit)

