TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
/*
+-----------------------------------------------------------------------------+
| WDTCLKUEN - WDT clock source update enable register
+-----------------------------------------------------------------------------+
*/

#define WDTCLKUEN_ENA_bit					0

#define WDTCLKUEN_ENA						(1 << WDTCLKUEN_ENA_bit)

/*
+-----------------------------------------------------------------------------+
| WDTCLKDIV - WDT clock divider register
+-----------------------------------------------------------------------------+
*/

#define WDTCLKDIV_DIV_bit					0
#define WDTCLKDIV_DIV_0_bit					0
#define WDTCLKDIV_DIV_1_bit					1
#define WDTCLKDIV_DIV_2_bit					2
#define WDTCLKDIV_DIV_3_bit					3
#define WDTCLKDIV_DIV_4_bit					4
#define WDTCLKDIV_DIV_5_bit					5
#define WDTCLKDIV_DIV_6_bit					6
#define WDTCLKDIV_DIV_7_bit					7

#define WDTCLKDIV_DIV_0						(1 << WDTCLKDIV_DIV_0_bit)
#define WDTCLKDIV_DIV_1						(1 << WDTCLKDIV_DIV_1_bit)
#define WDTCLKDIV_DIV_2						(1 << WDTCLKDIV_DIV_2_bit)
#define WDTCLKDIV_DIV_3						(1 << WDTCLKDIV_DIV_3_bit)
#define WDTCLKDIV_DIV_4						(1 << WDTCLKDIV_DIV_4_bit)
#define WDTCLKDIV_DIV_5						(1 << WDTCLKDIV_DIV_5_bit)
#define WDTCLKDIV_DIV_6						(1 << WDTCLKDIV_DIV_6_bit)
#define WDTCLKDIV_DIV_7						(1 << WDTCLKDIV_DIV_7_bit)

#define WDTCLKDIV_DIV_CLKDISABLED_value		0
#define WDTCLKDIV_DIV_mask					255

#define WDTCLKDIV_DIV_CLKDISABLED			(WDTCLKDIV_DIV_CLKDISABLED_value << WDTCLKDIV_DIV_bit)

/*
+-----------------------------------------------------------------------------+
| CLKOUTCLKSEL - CLKOUT clock source select register
+-----------------------------------------------------------------------------+
*/

#define CLKOUTCLKSEL_SEL_bit				0
#define CLKOUTCLKSEL_SEL_0_bit				0
#define CLKOUTCLKSEL_SEL_1_bit				1

#define CLKOUTCLKSEL_SEL_0					(1 << CLKOUTCLKSEL_SEL_0_bit)
#define CLKOUTCLKSEL_SEL_1					(1 << CLKOUTCLKSEL_SEL_1_bit)

#define CLKOUTCLKSEL_SEL_IRC_value			0
#define CLKOUTCLKSEL_SEL_SYSOSC_value		1
#define CLKOUTCLKSEL_SEL_WDTOSC_value		2
#define CLKOUTCLKSEL_SEL_MAINCLK_value		3
#define CLKOUTCLKSEL_SEL_mask				3

#define CLKOUTCLKSEL_SEL_IRC				(CLKOUTCLKSEL_SEL_IRC_value << CLKOUTCLKSEL_SEL_bit)
#define CLKOUTCLKSEL_SEL_SYSOSC				(CLKOUTCLKSEL_SEL_SYSOSC_value << CLKOUTCLKSEL_SEL_bit)
#define CLKOUTCLKSEL_SEL_WDTOSC				(CLKOUTCLKSEL_SEL_WDTOSC_value << CLKOUTCLKSEL_SEL_bit)
#define CLKOUTCLKSEL_SEL_MAINCLK			(CLKOUTCLKSEL_SEL_MAINCLK_value << CLKOUTCLKSEL_SEL_bit)

/*
+-----------------------------------------------------------------------------+
| CLKOUTUEN - CLKOUT clock source update enable register
+-----------------------------------------------------------------------------+
*/

#define CLKOUTUEN_ENA_bit					0

#define CLKOUTUEN_ENA						(1 << CLKOUTUEN_ENA_bit)

/*
+-----------------------------------------------------------------------------+
| CLKOUTCLKDIV - CLKOUT clock divider registers
+-----------------------------------------------------------------------------+
*/

#define CLKOUTCLKDIV_DIV_bit				0
#define CLKOUTCLKDIV_DIV_0_bit				0
#define CLKOUTCLKDIV_DIV_1_bit				1
#define CLKOUTCLKDIV_DIV_2_bit				2
#define CLKOUTCLKDIV_DIV_3_bit				3
#define CLKOUTCLKDIV_DIV_4_bit				4
#define CLKOUTCLKDIV_DIV_5_bit				5
#define CLKOUTCLKDIV_DIV_6_bit				6
#define CLKOUTCLKDIV_DIV_7_bit				7

#define CLKOUTCLKDIV_DIV_0					(1 << CLKOUTCLKDIV_DIV_0_bit)
#define CLKOUTCLKDIV_DIV_1					(1 << CLKOUTCLKDIV_DIV_1_bit)
#define CLKOUTCLKDIV_DIV_2					(1 << CLKOUTCLKDIV_DIV_2_bit)
#define CLKOUTCLKDIV_DIV_3					(1 << CLKOUTCLKDIV_DIV_3_bit)
#define CLKOUTCLKDIV_DIV_4					(1 << CLKOUTCLKDIV_DIV_4_bit)
#define CLKOUTCLKDIV_DIV_5					(1 << CLKOUTCLKDIV_DIV_5_bit)
#define CLKOUTCLKDIV_DIV_6					(1 << CLKOUTCLKDIV_DIV_6_bit)
#define CLKOUTCLKDIV_DIV_7					(1 << CLKOUTCLKDIV_DIV_7_bit)

#define CLKOUTCLKDIV_DIV_CLKDISABLED_value	0
#define CLKOUTCLKDIV_DIV_mask				255

#define CLKOUTCLKDIV_DIV_CLKDISABLED		(CLKOUTCLKDIV_DIV_CLKDISABLED_value << CLKOUTCLKDIV_DIV_bit)

/*
+-----------------------------------------------------------------------------+
| PIOPORCAP0 - POR captured PIO status registers 0
+-----------------------------------------------------------------------------+
*/

#define PIOPORCAP0_CAPPIO0_0_bit			0
#define PIOPORCAP0_CAPPIO0_1_bit			1
#define PIOPORCAP0_CAPPIO0_2_bit			2
#define PIOPORCAP0_CAPPIO0_3_bit			3
#define PIOPORCAP0_CAPPIO0_4_bit			4
#define PIOPORCAP0_CAPPIO0_5_bit			5
#define PIOPORCAP0_CAPPIO0_6_bit			6
#define PIOPORCAP0_CAPPIO0_7_bit			7
#define PIOPORCAP0_CAPPIO0_8_bit			8
#define PIOPORCAP0_CAPPIO0_9_bit			9
#define PIOPORCAP0_CAPPIO0_10_bit			10
#define PIOPORCAP0_CAPPIO0_11_bit			11
#define PIOPORCAP0_CAPPIO1_0_bit			12
#define PIOPORCAP0_CAPPIO1_1_bit			13
#define PIOPORCAP0_CAPPIO1_2_bit			14
#define PIOPORCAP0_CAPPIO1_3_bit			15
#define PIOPORCAP0_CAPPIO1_4_bit			16
#define PIOPORCAP0_CAPPIO1_5_bit			17
#define PIOPORCAP0_CAPPIO1_6_bit			18
#define PIOPORCAP0_CAPPIO1_7_bit			19
#define PIOPORCAP0_CAPPIO1_8_bit			20
#define PIOPORCAP0_CAPPIO1_9_bit			21
#define PIOPORCAP0_CAPPIO1_10_bit			22
#define PIOPORCAP0_CAPPIO1_11_bit			23
#define PIOPORCAP0_CAPPIO2_0_bit			24
#define PIOPORCAP0_CAPPIO2_1_bit			25
#define PIOPORCAP0_CAPPIO2_2_bit			26
#define PIOPORCAP0_CAPPIO2_3_bit			27
#define PIOPORCAP0_CAPPIO2_4_bit			28
#define PIOPORCAP0_CAPPIO2_5_bit			29
#define PIOPORCAP0_CAPPIO2_6_bit			30
#define PIOPORCAP0_CAPPIO2_7_bit			31

#define PIOPORCAP0_CAPPIO0_0				(1 << PIOPORCAP0_CAPPIO0_0_bit)
#define PIOPORCAP0_CAPPIO0_1				(1 << PIOPORCAP0_CAPPIO0_1_bit)
#define PIOPORCAP0_CAPPIO0_2				(1 << PIOPORCAP0_CAPPIO0_2_bit)
#define PIOPORCAP0_CAPPIO0_3				(1 << PIOPORCAP0_CAPPIO0_3_bit)
#define PIOPORCAP0_CAPPIO0_4				(1 << PIOPORCAP0_CAPPIO0_4_bit)
#define PIOPORCAP0_CAPPIO0_5				(1 << PIOPORCAP0_CAPPIO0_5_bit)
#define PIOPORCAP0_CAPPIO0_6				(1 << PIOPORCAP0_CAPPIO0_6_bit)
#define PIOPORCAP0_CAPPIO0_7				(1 << PIOPORCAP0_CAPPIO0_7_bit)
#define PIOPORCAP0_CAPPIO0_8				(1 << PIOPORCAP0_CAPPIO0_8_bit)
#define PIOPORCAP0_CAPPIO0_9				(1 << PIOPORCAP0_CAPPIO0_9_bit)
#define PIOPORCAP0_CAPPIO0_10				(1 << PIOPORCAP0_CAPPIO0_10_bit)
#define PIOPORCAP0_CAPPIO0_11				(1 << PIOPORCAP0_CAPPIO0_11_bit)
#define PIOPORCAP0_CAPPIO1_0				(1 << PIOPORCAP0_CAPPIO1_0_bit)
#define PIOPORCAP0_CAPPIO1_1				(1 << PIOPORCAP0_CAPPIO1_1_bit)
#define PIOPORCAP0_CAPPIO1_2				(1 << PIOPORCAP0_CAPPIO1_2_bit)
#define PIOPORCAP0_CAPPIO1_3				(1 << PIOPORCAP0_CAPPIO1_3_bit)
#define PIOPORCAP0_CAPPIO1_4				(1 << PIOPORCAP0_CAPPIO1_4_bit)
#define PIOPORCAP0_CAPPIO1_5				(1 << PIOPORCAP0_CAPPIO1_5_bit)
#define PIOPORCAP0_CAPPIO1_6				(1 << PIOPORCAP0_CAPPIO1_6_bit)
#define PIOPORCAP0_CAPPIO1_7				(1 << PIOPORCAP0_CAPPIO1_7_bit)
#define PIOPORCAP0_CAPPIO1_8				(1 << PIOPORCAP0_CAPPIO1_8_bit)
#define PIOPORCAP0_CAPPIO1_9				(1 << PIOPORCAP0_CAPPIO1_9_bit)
#define PIOPORCAP0_CAPPIO1_10				(1 << PIOPORCAP0_CAPPIO1_10_bit)
#define PIOPORCAP0_CAPPIO1_11				(1 << PIOPORCAP0_CAPPIO1_11_bit)
#define PIOPORCAP0_CAPPIO2_0				(1 << PIOPORCAP0_CAPPIO2_0_bit)
#define PIOPORCAP0_CAPPIO2_1				(1 << PIOPORCAP0_CAPPIO2_1_bit)
#define PIOPORCAP0_CAPPIO2_2				(1 << PIOPORCAP0_CAPPIO2_2_bit)
#define PIOPORCAP0_CAPPIO2_3				(1 << PIOPORCAP0_CAPPIO2_3_bit)
#define PIOPORCAP0_CAPPIO2_4				(1 << PIOPORCAP0_CAPPIO2_4_bit)
#define PIOPORCAP0_CAPPIO2_5				(1 << PIOPORCAP0_CAPPIO2_5_bit)
#define PIOPORCAP0_CAPPIO2_6				(1 << PIOPORCAP0_CAPPIO2_6_bit)
#define PIOPORCAP0_CAPPIO2_7				(1 << PIOPORCAP0_CAPPIO2_7_bit)

