TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
/*
+-----------------------------------------------------------------------------+
| PIOPORCAP1 - POR captured PIO status registers 1
+-----------------------------------------------------------------------------+
*/

#define PIOPORCAP1_CAPPIO2_8_bit			0
#define PIOPORCAP1_CAPPIO2_9_bit			1
#define PIOPORCAP1_CAPPIO2_10_bit			2
#define PIOPORCAP1_CAPPIO2_11_bit			3
#define PIOPORCAP1_CAPPIO3_0_bit			4
#define PIOPORCAP1_CAPPIO3_1_bit			5
#define PIOPORCAP1_CAPPIO3_2_bit			6
#define PIOPORCAP1_CAPPIO3_3_bit			7
#define PIOPORCAP1_CAPPIO3_4_bit			8
#define PIOPORCAP1_CAPPIO3_5_bit			9

#define PIOPORCAP1_CAPPIO2_8				(1 << PIOPORCAP1_CAPPIO2_8_bit)
#define PIOPORCAP1_CAPPIO2_9				(1 << PIOPORCAP1_CAPPIO2_9_bit)
#define PIOPORCAP1_CAPPIO2_10				(1 << PIOPORCAP1_CAPPIO2_10_bit)
#define PIOPORCAP1_CAPPIO2_11				(1 << PIOPORCAP1_CAPPIO2_11_bit)
#define PIOPORCAP1_CAPPIO3_0				(1 << PIOPORCAP1_CAPPIO3_0_bit)
#define PIOPORCAP1_CAPPIO3_1				(1 << PIOPORCAP1_CAPPIO3_1_bit)
#define PIOPORCAP1_CAPPIO3_2				(1 << PIOPORCAP1_CAPPIO3_2_bit)
#define PIOPORCAP1_CAPPIO3_3				(1 << PIOPORCAP1_CAPPIO3_3_bit)
#define PIOPORCAP1_CAPPIO3_4				(1 << PIOPORCAP1_CAPPIO3_4_bit)
#define PIOPORCAP1_CAPPIO3_5				(1 << PIOPORCAP1_CAPPIO3_5_bit)

/*
+-----------------------------------------------------------------------------+
| BODCTRL - BOD control register
+-----------------------------------------------------------------------------+
*/

#define BODCTRL_BODRSTLEV_bit				0
#define BODCTRL_BODRSTLEV_0_bit				0
#define BODCTRL_BODRSTLEV_1_bit				1
#define BODCTRL_BODINTVAL_bit				2
#define BODCTRL_BODINTVAL_0_bit				2
#define BODCTRL_BODINTVAL_1_bit				3
#define BODCTRL_BODRSTENA_bit				4

#define BODCTRL_BODRSTLEV_0					(1 << BODCTRL_BODRSTLEV_0_bit)
#define BODCTRL_BODRSTLEV_1					(1 << BODCTRL_BODRSTLEV_1_bit)
#define BODCTRL_BODINTVAL_0					(1 << BODCTRL_BODINTVAL_0_bit)
#define BODCTRL_BODINTVAL_1					(1 << BODCTRL_BODINTVAL_1_bit)
#define BODCTRL_BODRSTENA					(1 << BODCTRL_BODRSTENA_bit)

#define BODCTRL_BODRSTLEV_LEVEL0_value		0
#define BODCTRL_BODRSTLEV_LEVEL1_value		1
#define BODCTRL_BODRSTLEV_LEVEL2_value		2
#define BODCTRL_BODRSTLEV_LEVEL3_value		3
#define BODCTRL_BODRSTLEV_mask				3

#define BODCTRL_BODINTVAL_LEVEL0_value		0
#define BODCTRL_BODINTVAL_LEVEL1_value		1
#define BODCTRL_BODINTVAL_LEVEL2_value		2
#define BODCTRL_BODINTVAL_LEVEL3_value		3
#define BODCTRL_BODINTVAL_mask				3

#define BODCTRL_BODRSTLEV_LEVEL0			(BODCTRL_BODRSTLEV_LEVEL0_value << BODCTRL_BODRSTLEV_bit)
#define BODCTRL_BODRSTLEV_LEVEL1			(BODCTRL_BODRSTLEV_LEVEL1_value << BODCTRL_BODRSTLEV_bit)
#define BODCTRL_BODRSTLEV_LEVEL2			(BODCTRL_BODRSTLEV_LEVEL2_value << BODCTRL_BODRSTLEV_bit)
#define BODCTRL_BODRSTLEV_LEVEL3			(BODCTRL_BODRSTLEV_LEVEL3_value << BODCTRL_BODRSTLEV_bit)

#define BODCTRL_BODINTVAL_LEVEL0			(BODCTRL_BODINTVAL_LEVEL0_value << BODCTRL_BODINTVAL_bit)
#define BODCTRL_BODINTVAL_LEVEL1			(BODCTRL_BODINTVAL_LEVEL1_value << BODCTRL_BODINTVAL_bit)
#define BODCTRL_BODINTVAL_LEVEL2			(BODCTRL_BODINTVAL_LEVEL2_value << BODCTRL_BODINTVAL_bit)
#define BODCTRL_BODINTVAL_LEVEL3			(BODCTRL_BODINTVAL_LEVEL3_value << BODCTRL_BODINTVAL_bit)

/*
+-----------------------------------------------------------------------------+
| SYSTCKCAL - System tick timer calibration register
+-----------------------------------------------------------------------------+
*/

#define SYSTCKCAL_CAL_bit					0
#define SYSTCKCAL_CAL_0_bit					0
#define SYSTCKCAL_CAL_1_bit					1
#define SYSTCKCAL_CAL_2_bit					2
#define SYSTCKCAL_CAL_3_bit					3
#define SYSTCKCAL_CAL_4_bit					4
#define SYSTCKCAL_CAL_5_bit					5
#define SYSTCKCAL_CAL_6_bit					6
#define SYSTCKCAL_CAL_7_bit					7
#define SYSTCKCAL_CAL_8_bit					8
#define SYSTCKCAL_CAL_9_bit					9
#define SYSTCKCAL_CAL_10_bit				10
#define SYSTCKCAL_CAL_11_bit				11
#define SYSTCKCAL_CAL_12_bit				12
#define SYSTCKCAL_CAL_13_bit				13
#define SYSTCKCAL_CAL_14_bit				14
#define SYSTCKCAL_CAL_15_bit				15
#define SYSTCKCAL_CAL_16_bit				16
#define SYSTCKCAL_CAL_17_bit				17
#define SYSTCKCAL_CAL_18_bit				18
#define SYSTCKCAL_CAL_19_bit				19
#define SYSTCKCAL_CAL_20_bit				20
#define SYSTCKCAL_CAL_21_bit				21
#define SYSTCKCAL_CAL_22_bit				22
#define SYSTCKCAL_CAL_23_bit				23
#define SYSTCKCAL_CAL_24_bit				24
#define SYSTCKCAL_CAL_25_bit				25

#define SYSTCKCAL_CAL_0						(1 << SYSTCKCAL_CAL_0_bit)
#define SYSTCKCAL_CAL_1						(1 << SYSTCKCAL_CAL_1_bit)
#define SYSTCKCAL_CAL_2						(1 << SYSTCKCAL_CAL_2_bit)
#define SYSTCKCAL_CAL_3						(1 << SYSTCKCAL_CAL_3_bit)
#define SYSTCKCAL_CAL_4						(1 << SYSTCKCAL_CAL_4_bit)
#define SYSTCKCAL_CAL_5						(1 << SYSTCKCAL_CAL_5_bit)
#define SYSTCKCAL_CAL_6						(1 << SYSTCKCAL_CAL_6_bit)
#define SYSTCKCAL_CAL_7						(1 << SYSTCKCAL_CAL_7_bit)
#define SYSTCKCAL_CAL_8						(1 << SYSTCKCAL_CAL_8_bit)
#define SYSTCKCAL_CAL_9						(1 << SYSTCKCAL_CAL_9_bit)
#define SYSTCKCAL_CAL_10					(1 << SYSTCKCAL_CAL_10_bit)
#define SYSTCKCAL_CAL_11					(1 << SYSTCKCAL_CAL_11_bit)
#define SYSTCKCAL_CAL_12					(1 << SYSTCKCAL_CAL_12_bit)
#define SYSTCKCAL_CAL_13					(1 << SYSTCKCAL_CAL_13_bit)
#define SYSTCKCAL_CAL_14					(1 << SYSTCKCAL_CAL_14_bit)
#define SYSTCKCAL_CAL_15					(1 << SYSTCKCAL_CAL_15_bit)
#define SYSTCKCAL_CAL_16					(1 << SYSTCKCAL_CAL_16_bit)
#define SYSTCKCAL_CAL_17					(1 << SYSTCKCAL_CAL_17_bit)
#define SYSTCKCAL_CAL_18					(1 << SYSTCKCAL_CAL_18_bit)
#define SYSTCKCAL_CAL_19					(1 << SYSTCKCAL_CAL_19_bit)
#define SYSTCKCAL_CAL_20					(1 << SYSTCKCAL_CAL_20_bit)
#define SYSTCKCAL_CAL_21					(1 << SYSTCKCAL_CAL_21_bit)
#define SYSTCKCAL_CAL_22					(1 << SYSTCKCAL_CAL_22_bit)
#define SYSTCKCAL_CAL_23					(1 << SYSTCKCAL_CAL_23_bit)
#define SYSTCKCAL_CAL_24					(1 << SYSTCKCAL_CAL_24_bit)
#define SYSTCKCAL_CAL_25					(1 << SYSTCKCAL_CAL_25_bit)

/*
+-----------------------------------------------------------------------------+
| STARTAPRP0 - Start logic edge control register 0
+-----------------------------------------------------------------------------+
*/

#define STARTAPRP0_APRPIO0_0_bit			0
#define STARTAPRP0_APRPIO0_1_bit			1
#define STARTAPRP0_APRPIO0_2_bit			2
#define STARTAPRP0_APRPIO0_3_bit			3
#define STARTAPRP0_APRPIO0_4_bit			4
#define STARTAPRP0_APRPIO0_5_bit			5
#define STARTAPRP0_APRPIO0_6_bit			6
#define STARTAPRP0_APRPIO0_7_bit			7
#define STARTAPRP0_APRPIO0_8_bit			8
#define STARTAPRP0_APRPIO0_9_bit			9
#define STARTAPRP0_APRPIO0_10_bit			10
#define STARTAPRP0_APRPIO0_11_bit			11
#define STARTAPRP0_APRPIO1_0_bit			12

