TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
#define STARTAPRP0_APRPIO0_0				(1 << STARTAPRP0_APRPIO0_0_bit)
#define STARTAPRP0_APRPIO0_1				(1 << STARTAPRP0_APRPIO0_1_bit)
#define STARTAPRP0_APRPIO0_2				(1 << STARTAPRP0_APRPIO0_2_bit)
#define STARTAPRP0_APRPIO0_3				(1 << STARTAPRP0_APRPIO0_3_bit)
#define STARTAPRP0_APRPIO0_4				(1 << STARTAPRP0_APRPIO0_4_bit)
#define STARTAPRP0_APRPIO0_5				(1 << STARTAPRP0_APRPIO0_5_bit)
#define STARTAPRP0_APRPIO0_6				(1 << STARTAPRP0_APRPIO0_6_bit)
#define STARTAPRP0_APRPIO0_7				(1 << STARTAPRP0_APRPIO0_7_bit)
#define STARTAPRP0_APRPIO0_8				(1 << STARTAPRP0_APRPIO0_8_bit)
#define STARTAPRP0_APRPIO0_9				(1 << STARTAPRP0_APRPIO0_9_bit)
#define STARTAPRP0_APRPIO0_10				(1 << STARTAPRP0_APRPIO0_10_bit)
#define STARTAPRP0_APRPIO0_11				(1 << STARTAPRP0_APRPIO0_11_bit)
#define STARTAPRP0_APRPIO1_0				(1 << STARTAPRP0_APRPIO1_0_bit)

/*
+-----------------------------------------------------------------------------+
| STARTERP0 - Start logic signal enable register 0
+-----------------------------------------------------------------------------+
*/

#define STARTERP0_ERPIO0_0_bit				0
#define STARTERP0_ERPIO0_1_bit				1
#define STARTERP0_ERPIO0_2_bit				2
#define STARTERP0_ERPIO0_3_bit				3
#define STARTERP0_ERPIO0_4_bit				4
#define STARTERP0_ERPIO0_5_bit				5
#define STARTERP0_ERPIO0_6_bit				6
#define STARTERP0_ERPIO0_7_bit				7
#define STARTERP0_ERPIO0_8_bit				8
#define STARTERP0_ERPIO0_9_bit				9
#define STARTERP0_ERPIO0_10_bit				10
#define STARTERP0_ERPIO0_11_bit				11
#define STARTERP0_ERPIO1_0_bit				12

#define STARTERP0_ERPIO0_0					(1 << STARTERP0_ERPIO0_0_bit)
#define STARTERP0_ERPIO0_1					(1 << STARTERP0_ERPIO0_1_bit)
#define STARTERP0_ERPIO0_2					(1 << STARTERP0_ERPIO0_2_bit)
#define STARTERP0_ERPIO0_3					(1 << STARTERP0_ERPIO0_3_bit)
#define STARTERP0_ERPIO0_4					(1 << STARTERP0_ERPIO0_4_bit)
#define STARTERP0_ERPIO0_5					(1 << STARTERP0_ERPIO0_5_bit)
#define STARTERP0_ERPIO0_6					(1 << STARTERP0_ERPIO0_6_bit)
#define STARTERP0_ERPIO0_7					(1 << STARTERP0_ERPIO0_7_bit)
#define STARTERP0_ERPIO0_8					(1 << STARTERP0_ERPIO0_8_bit)
#define STARTERP0_ERPIO0_9					(1 << STARTERP0_ERPIO0_9_bit)
#define STARTERP0_ERPIO0_10					(1 << STARTERP0_ERPIO0_10_bit)
#define STARTERP0_ERPIO0_11					(1 << STARTERP0_ERPIO0_11_bit)
#define STARTERP0_ERPIO1_0					(1 << STARTERP0_ERPIO1_0_bit)

/*
+-----------------------------------------------------------------------------+
| STARTRSRP0CLR - Start logic reset register 0
+-----------------------------------------------------------------------------+
*/

#define STARTRSRP0CLR_RSRPIO0_0_bit			0
#define STARTRSRP0CLR_RSRPIO0_1_bit			1
#define STARTRSRP0CLR_RSRPIO0_2_bit			2
#define STARTRSRP0CLR_RSRPIO0_3_bit			3
#define STARTRSRP0CLR_RSRPIO0_4_bit			4
#define STARTRSRP0CLR_RSRPIO0_5_bit			5
#define STARTRSRP0CLR_RSRPIO0_6_bit			6
#define STARTRSRP0CLR_RSRPIO0_7_bit			7
#define STARTRSRP0CLR_RSRPIO0_8_bit			8
#define STARTRSRP0CLR_RSRPIO0_9_bit			9
#define STARTRSRP0CLR_RSRPIO0_10_bit		10
#define STARTRSRP0CLR_RSRPIO0_11_bit		11
#define STARTRSRP0CLR_RSRPIO1_0_bit			12

#define STARTRSRP0CLR_RSRPIO0_0				(1 << STARTRSRP0CLR_RSRPIO0_0_bit)
#define STARTRSRP0CLR_RSRPIO0_1				(1 << STARTRSRP0CLR_RSRPIO0_1_bit)
#define STARTRSRP0CLR_RSRPIO0_2				(1 << STARTRSRP0CLR_RSRPIO0_2_bit)
#define STARTRSRP0CLR_RSRPIO0_3				(1 << STARTRSRP0CLR_RSRPIO0_3_bit)
#define STARTRSRP0CLR_RSRPIO0_4				(1 << STARTRSRP0CLR_RSRPIO0_4_bit)
#define STARTRSRP0CLR_RSRPIO0_5				(1 << STARTRSRP0CLR_RSRPIO0_5_bit)
#define STARTRSRP0CLR_RSRPIO0_6				(1 << STARTRSRP0CLR_RSRPIO0_6_bit)
#define STARTRSRP0CLR_RSRPIO0_7				(1 << STARTRSRP0CLR_RSRPIO0_7_bit)
#define STARTRSRP0CLR_RSRPIO0_8				(1 << STARTRSRP0CLR_RSRPIO0_8_bit)
#define STARTRSRP0CLR_RSRPIO0_9				(1 << STARTRSRP0CLR_RSRPIO0_9_bit)
#define STARTRSRP0CLR_RSRPIO0_10			(1 << STARTRSRP0CLR_RSRPIO0_10_bit)
#define STARTRSRP0CLR_RSRPIO0_11			(1 << STARTRSRP0CLR_RSRPIO0_11_bit)
#define STARTRSRP0CLR_RSRPIO1_0				(1 << STARTRSRP0CLR_RSRPIO1_0_bit)

/*
+-----------------------------------------------------------------------------+
| STARTSRP0 - Start logic status register 0
+-----------------------------------------------------------------------------+
*/

#define STARTSRP0_SRPIO0_0_bit				0
#define STARTSRP0_SRPIO0_1_bit				1
#define STARTSRP0_SRPIO0_2_bit				2
#define STARTSRP0_SRPIO0_3_bit				3
#define STARTSRP0_SRPIO0_4_bit				4
#define STARTSRP0_SRPIO0_5_bit				5
#define STARTSRP0_SRPIO0_6_bit				6
#define STARTSRP0_SRPIO0_7_bit				7
#define STARTSRP0_SRPIO0_8_bit				8
#define STARTSRP0_SRPIO0_9_bit				9
#define STARTSRP0_SRPIO0_10_bit				10
#define STARTSRP0_SRPIO0_11_bit				11
#define STARTSRP0_SRPIO1_0_bit				12

#define STARTSRP0_SRPIO0_0					(1 << STARTSRP0_SRPIO0_0_bit)
#define STARTSRP0_SRPIO0_1					(1 << STARTSRP0_SRPIO0_1_bit)
#define STARTSRP0_SRPIO0_2					(1 << STARTSRP0_SRPIO0_2_bit)
#define STARTSRP0_SRPIO0_3					(1 << STARTSRP0_SRPIO0_3_bit)
#define STARTSRP0_SRPIO0_4					(1 << STARTSRP0_SRPIO0_4_bit)
#define STARTSRP0_SRPIO0_5					(1 << STARTSRP0_SRPIO0_5_bit)
#define STARTSRP0_SRPIO0_6					(1 << STARTSRP0_SRPIO0_6_bit)
#define STARTSRP0_SRPIO0_7					(1 << STARTSRP0_SRPIO0_7_bit)
#define STARTSRP0_SRPIO0_8					(1 << STARTSRP0_SRPIO0_8_bit)
#define STARTSRP0_SRPIO0_9					(1 << STARTSRP0_SRPIO0_9_bit)
#define STARTSRP0_SRPIO0_10					(1 << STARTSRP0_SRPIO0_10_bit)
#define STARTSRP0_SRPIO0_11					(1 << STARTSRP0_SRPIO0_11_bit)
#define STARTSRP0_SRPIO1_0					(1 << STARTSRP0_SRPIO1_0_bit)

/*
+-----------------------------------------------------------------------------+
| PDSLEEPCFG - Deep-sleep mode configuration register
+-----------------------------------------------------------------------------+
*/

#define PDSLEEPCFG_BOD_PD_bit				3
#define PDSLEEPCFG_WDTOSC_PD_bit			6

#define PDSLEEPCFG_BOD_PD					(1 << PDSLEEPCFG_BOD_PD_bit)
#define PDSLEEPCFG_WDTOSC_PD				(1 << PDSLEEPCFG_WDTOSC_PD_bit)


/*
+-----------------------------------------------------------------------------+
| PDAWAKECFG - Wake-up configuration register
+-----------------------------------------------------------------------------+
*/

