TomCrypto/bowshock/src/hal/lpc1114/headers/hdr_syscon.h
#define PDAWAKECFG_IRCOUT_PD_bit			0
#define PDAWAKECFG_IRC_PD_bit				1
#define PDAWAKECFG_FLASH_PD_bit				2
#define PDAWAKECFG_BOD_PD_bit				3
#define PDAWAKECFG_ADC_PD_bit				4
#define PDAWAKECFG_SYSOSC_PD_bit			5
#define PDAWAKECFG_WDTOSC_PD_bit			6
#define PDAWAKECFG_SYSPLL_PD_bit			7

#define PDAWAKECFG_IRCOUT_PD				(1 << PDAWAKECFG_IRCOUT_PD_bit)
#define PDAWAKECFG_IRC_PD					(1 << PDAWAKECFG_IRC_PD_bit)
#define PDAWAKECFG_FLASH_PD					(1 << PDAWAKECFG_FLASH_PD_bit)
#define PDAWAKECFG_BOD_PD					(1 << PDAWAKECFG_BOD_PD_bit)
#define PDAWAKECFG_ADC_PD					(1 << PDAWAKECFG_ADC_PD_bit)
#define PDAWAKECFG_SYSOSC_PD				(1 << PDAWAKECFG_SYSOSC_PD_bit)
#define PDAWAKECFG_WDTOSC_PD				(1 << PDAWAKECFG_WDTOSC_PD_bit)
#define PDAWAKECFG_SYSPLL_PD				(1 << PDAWAKECFG_SYSPLL_PD_bit)

/*
+-----------------------------------------------------------------------------+
| PDRUNCFG - Power-down configuration register
+-----------------------------------------------------------------------------+
*/

#define PDRUNCFG_IRCOUT_PD_bit				0
#define PDRUNCFG_IRC_PD_bit					1
#define PDRUNCFG_FLASH_PD_bit				2
#define PDRUNCFG_BOD_PD_bit					3
#define PDRUNCFG_ADC_PD_bit					4
#define PDRUNCFG_SYSOSC_PD_bit				5
#define PDRUNCFG_WDTOSC_PD_bit				6
#define PDRUNCFG_SYSPLL_PD_bit				7

#define PDRUNCFG_IRCOUT_PD					(1 << PDRUNCFG_IRCOUT_PD_bit)
#define PDRUNCFG_IRC_PD						(1 << PDRUNCFG_IRC_PD_bit)
#define PDRUNCFG_FLASH_PD					(1 << PDRUNCFG_FLASH_PD_bit)
#define PDRUNCFG_BOD_PD						(1 << PDRUNCFG_BOD_PD_bit)
#define PDRUNCFG_ADC_PD						(1 << PDRUNCFG_ADC_PD_bit)
#define PDRUNCFG_SYSOSC_PD					(1 << PDRUNCFG_SYSOSC_PD_bit)
#define PDRUNCFG_WDTOSC_PD					(1 << PDRUNCFG_WDTOSC_PD_bit)
#define PDRUNCFG_SYSPLL_PD					(1 << PDRUNCFG_SYSPLL_PD_bit)

/*
+-----------------------------------------------------------------------------+
| DEVICE_ID - Device ID register
+-----------------------------------------------------------------------------+
*/

#define DEVICE_ID_DEVICEID_LPC1111FHN33_101_value	0x041E502B
#define DEVICE_ID_DEVICEID_LPC1111FHN33_201_value	0x0416502B
#define DEVICE_ID_DEVICEID_LPC1112FHN33_101_value	0x042D502B
#define DEVICE_ID_DEVICEID_LPC1112FHN33_201_value	0x0425502B
#define DEVICE_ID_DEVICEID_LPC1113FHN33_201_value	0x0434502B
#define DEVICE_ID_DEVICEID_LPC1113FHN33_301_value	0x0434102B
#define DEVICE_ID_DEVICEID_LPC1113FBD48_301_value	0x0434102B
#define DEVICE_ID_DEVICEID_LPC1114FHN33_201_value	0x0444502B
#define DEVICE_ID_DEVICEID_LPC1114FHN33_301_value	0x0444102B
#define DEVICE_ID_DEVICEID_LPC1114FBD48_301_value	0x0444102B
#define DEVICE_ID_DEVICEID_LPC1114FA44_301_value	0x0444102B
#define DEVICE_ID_DEVICEID_LPC11C12_FBD48_301_value	0x1421102B
#define DEVICE_ID_DEVICEID_LPC11C14_FBD48_301_value	0x1440102B

/*
+-----------------------------------------------------------------------------+
| FLASHCFG - Flash configuration register
+-----------------------------------------------------------------------------+
*/

// Why is this register missing from LPC11xx.h file?
// Temporary define it here for now...
#include <stdint.h>
#define FLASHCFG							(*(volatile uint32_t*)0x4003C010)
// end of temporary fix

#define FLASHCFG_FLASHTIM_bit				0
#define FLASHCFG_FLASHTIM_0_bit				0
#define FLASHCFG_FLASHTIM_1_bit				1

#define FLASHCFG_FLASHTIM_0					(1 << FLASHCFG_FLASHTIM_0_bit)
#define FLASHCFG_FLASHTIM_1					(1 << FLASHCFG_FLASHTIM_1_bit)

#define FLASHCFG_FLASHTIM_1CLK_value		0
#define FLASHCFG_FLASHTIM_2CLK_value		1
#define FLASHCFG_FLASHTIM_3CLK_value		2
#define FLASHCFG_FLASHTIM_mask				3

#define FLASHCFG_FLASHTIM_1CLK				(FLASHCFG_FLASHTIM_1CLK_value << FLASHCFG_FLASHTIM_bit)
#define FLASHCFG_FLASHTIM_2CLK				(FLASHCFG_FLASHTIM_2CLK_value << FLASHCFG_FLASHTIM_bit)
#define FLASHCFG_FLASHTIM_3CLK				(FLASHCFG_FLASHTIM_3CLK_value << FLASHCFG_FLASHTIM_bit)

/******************************************************************************
* END OF FILE
******************************************************************************/
#endif /* HDR_SYSCON_H_ */
